In [7]:
import MySQLdb as sqldb
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
db = sqldb.connect(host='localhost', port=3306, user='root', passwd='1234', charset='utf8')
cursor = db.cursor()

In [8]:
df = pd.read_csv('budongsan.csv')
df.head()

,Unnamed: 0,매물번호,연락처,주소,부동산,보증금,월세
0,0,3467204.0,010-123-4567,서울시 강남구 역삼동 0,TODAY공인중개사(이인규),1000.0,100.0
1,1,3150497.0,010-123-4567,서울시 강남구 역삼동 1,TODAY공인중개사(이인규),11000.0,60.0
2,2,3440906.0,010-123-4567,서울시 강남구 역삼동 2,열린공인중개사(강광수),5000.0,65.0
3,3,3376834.0,010-123-4567,서울시 강남구 역삼동 3,미래공인중개사(김유철),3000.0,95.0
4,4,3331511.0,010-123-4567,서울시 강남구 역삼동 4,한백부동산공인중개사(김남조),110.0,110.0

In [6]:
sql = """
show databases;
"""
pd.read_sql(sql,db)

             Database
0           employees
1  information_schema
2               mysql
3  performance_schema
4              sakila
5              shopdb
6               sqldb
7                 sys
8              testdb
9               world

In [10]:
sql = """
create database if not exists budongsan;
"""
cursor.execute(sql)

1

In [11]:
sql = """
use budongsan;
"""
cursor.execute(sql)

0

In [12]:
sql = """
show tables;
"""
pd.read_sql(sql,db)

Empty DataFrame
Columns: [Tables_in_budongsan]
Index: []

In [21]:
sql = """
create table if not exists provider(
provider_id int primary key,
name varchar(255)
);
"""

cursor.execute(sql)

0

In [22]:
sql = """
insert into provider values(2,'우리부동산');
insert into provider values(3,'현대부동산');
insert into provider values(4,'휴먼부동산');
insert into provider values(5,'미래부동산');
"""
cursor.execute(sql)

1

In [19]:
sql = """
drop table provider;
"""
cursor.execute(sql)

0

In [17]:
sql = 'select * from provider'
pd.read_sql(sql,db)

   provider_id   name
0            2  우리부동산
1            3  현대부동산
2            4  휴먼부동산
3            5  미래부동산

In [54]:
df_db = pd.read_csv('budongsan.csv', index_col=0)
df_db.head()

        매물번호           연락처             주소              부동산      보증금     월세
0  3467204.0  010-123-4567  서울시 강남구 역삼동 0  TODAY공인중개사(이인규)   1000.0  100.0
1  3150497.0  010-123-4567  서울시 강남구 역삼동 1  TODAY공인중개사(이인규)  11000.0   60.0
2  3440906.0  010-123-4567  서울시 강남구 역삼동 2     열린공인중개사(강광수)   5000.0   65.0
3  3376834.0  010-123-4567  서울시 강남구 역삼동 3     미래공인중개사(김유철)   3000.0   95.0
4  3331511.0  010-123-4567  서울시 강남구 역삼동 4  한백부동산공인중개사(김남조)    110.0  110.0

In [20]:
df_db.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  43 non-null     int64
 1   매물번호        43 non-null     float64
 2   연락처         43 non-null     object
 3   주소          43 non-null     object
 4   부동산         43 non-null     object
 5   보증금         43 non-null     float64
 6   월세          43 non-null     float64
dtypes: float64(3), int64(1), object(3)
memory usage: 2.5+ KB

In [70]:
sql = """
create table if not exists agency (
prd_no int primary key,
phone char(12) not null,
addr varchar(20),
b_agency varchar(30),
deposit int,
rent int);
"""

cursor.execute(sql)

0

In [59]:
sql = 'show tables;'
pd.read_sql(sql,db)

  Tables_in_budongsan
0              agency
1            provider

In [60]:
sql = 'select * from agency;'
pd.read_sql(sql,db)

Empty DataFrame
Columns: [prd_no, phone, addr, b_agency, deposit, rent]
Index: []

In [69]:
sql = """
drop table agency;
"""
cursor.execute(sql)

0

In [62]:
a = df_db.iloc[0]
a

매물번호          3467204.0
연락처        010-123-4567
주소        서울시 강남구 역삼동 0
부동산     TODAY공인중개사(이인규)
보증금              1000.0
월세                100.0
Name: 0, dtype: object

In [72]:
# {}에 문자열이 들어올 경우 ''까지 표시
for i in range(len(df_db)):
    a = df_db.iloc[i]
    sql = "insert into agency values({},'{}','{}','{}',{},{});".format(a.iloc[0], a.iloc[1], a.iloc[2], a.iloc[3], a.iloc[4], a.iloc[5])
    cursor.execute(sql)

In [73]:
sql = "select * from agency;"
df = pd.read_sql(sql, db)

In [74]:
df.to_csv('agency.csv')

In [75]:
df.head()

    prd_no         phone            addr         b_agency  deposit  rent
0  3103384  010-123-4567  서울시 강남구 역삼동 17  TODAY공인중개사(이인규)     5000    50
1  3150497  010-123-4567   서울시 강남구 역삼동 1  TODAY공인중개사(이인규)    11000    60
2  3181675  010-123-4567  서울시 강남구 역삼동 20  TODAY공인중개사(이인규)     5000    60
3  3190410  010-123-4567  서울시 강남구 역삼동 28     건우공인중개사(김상모)       70    70
4  3228631  010-123-4567  서울시 강남구 역삼동 10   HS강남공인중개사(김현수)     1000    96

In [76]:
df.deposit.mean()

3512.046511627907

In [77]:
df.sort_values('rent').head()

     prd_no         phone            addr           b_agency  deposit  rent
30  3451078  010-123-4567  서울시 강남구 역삼동 32       스타공인중개사(박정직)     4000    40
0   3103384  010-123-4567  서울시 강남구 역삼동 17    TODAY공인중개사(이인규)     5000    50
29  3450803  010-123-4567  서울시 강남구 역삼동 35       스타공인중개사(박정직)     6000    50
6   3262172  010-123-4567   서울시 강남구 역삼동 9       스타공인중개사(박정직)     2000    50
37  3495453  010-123-4567  서울시 강남구 역삼동 30  부동산네트워크공인중개사(황창문)     8000    55